#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```

grafana_folder.folder1: Refreshing state... [id=0:32]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # grafana_dashboard.test will be created
  + resource "grafana_dashboard" "test" {
      + config_json  = jsonencode(
            {
              + title = "My Dashboard"
              + uid   = "my-dashboard-uid"
            }
        )
      + dashboard_id = (known after apply)
      + folder       = "adc8sfaj7aozkf"
      + id           = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: test-10.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "test-10.tfplan"
```

</details>

*Pusher: @germanium-git, Action: `pull_request`, Workflow: `Terraform: Test on PR open`*